#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Rhetoric
#+STARTUP: showall
#+PROPERTY: filename
  :PROPERTIES:
  :Name: /home/deerpig/proj/chenla/trivium/triv-rhetoric.org
  :Created: 2017-03-10T15:02@Prek Leap (11.642600N-104.919210W)
  :ID: 03cf0f32-e082-4651-a8a5-bda176ae1c8e
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES='git log $TAG...HEAD --pretty="<li>%s</li>\n" -- (file-name-nondirectory (buffer-file-name))'
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>


#+begin_src emacs-lisp
(let ((git-repo "./"))
  (git-run "log" "v00.01.01...HEAD --pretty=<li>%s</li>"))
#+end_src

#+RESULTS:
#+begin_example
commit c31c1e61d5da4a99fde397cc8c7b6d6c553ad6ed
Author: Deerpig <brad@chenla.la>
Date:   Tue Mar 28 18:06:35 2017 +0700

    moved text to deploy-social

commit 7c7e339819217ce5ab6d7394f5a9df7eeede01c1
Author: Deerpig <brad@chenla.la>
Date:   Mon Mar 27 21:05:01 2017 +0700

    golden rule links

commit 918243b25254b9377f8c69f64392f0a3730dd09a
Author: Deerpig <brad@chenla.la>
Date:   Mon Mar 27 20:43:28 2017 +0700

    added link to TedTalk
#+end_example



